IDEA StatiCa Open Model
Material.StateOfThermalStrain Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 State of thermal strain curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ThermalStrainState StateOfThermalStrain { get; set; }
Public Property StateOfThermalStrain As ThermalStrainState
	Get
	Set
public:
property ThermalStrainState StateOfThermalStrain {
	ThermalStrainState get ();
	void set (ThermalStrainState value);
}
Property Value
Type: ThermalStrainState
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace